/*
1083: 求矩阵的局部极大值
时间限制: 1 Sec  内存限制: 128 MB
题目描述
给定M行N列的整数矩阵A，如果A的非边界元素A[i][j]大于相邻的上下左右4个元素，那么就称元素A[i][j]是矩阵的局部极大值。本题要求给定矩阵的全部局部极大值及其所在的位置。
输入
输入在第一行中给出矩阵A的行数M和列数N（3≤M,N≤20）；最后M行，每行给出A在该行的N个元素的值。数字间以空格分隔。
输出
每行按照“元素值 行号
列号”的格式输出一个局部极大值，其中行、列编号从1开始。要求按照行号递增输出；若同行有超过1个局部极大值，则该行按列号递增输出。若没有局部极大值，则输出“None
总行数 总列数”。 样例输入 4 5 1 1 1 1 1 1 3 9 3 1 1 5 3 5 1 1 1 1 1 1 样例输出
9 2 3
5 3 2
5 3 4
*/
#define _CRT_SECURE_NO_WARNINGS
#include <stdio.h>
int main(void)
{
    int M, N, i, j, flag = 0;
    scanf("%d%d", &M, &N);
    int a[M][N];
    for (i = 0; i < M; i++)
        for (j = 0; j < N; j++)
            scanf("%d", &a[i][j]);
    for (i = 1; i < M - 1; i++)
        for (j = 1; j < N - 1; j++)
            if (a[i][j] > a[i + 1][j] && a[i][j] > a[i - 1][j] && a[i][j] > a[i][j - 1] && a[i][j] > a[i][j + 1])
            {
                printf("%d %d %d\n", a[i][j], i + 1, j + 1);
                flag = 1;
            }
    if (flag == 0)
    {
        printf("None %d %d", M, N);
    }
    return 0;
}